<template>
  <div>
    1. 이상형 월드컵 페이지에 들어가면 64강과 32강 중 고를 수 있음
    2. 64강에 들어가면 64강 페이지로 이동하고 popularMovie를 얻는 얻는 코드와 동일한 코드로 64개의 인기영화(worldcup64)를 받아옴(created함수에 넣음)
    3. 그 중 2개의 영화를 랜덤으로 가지고 와서(그와 동시에 worldcup64에서 그 2개의 영화를 지움) 화면에 띄워줌(created함수에 넣음) (이 2개의 영화도 새로운 리스트에 담아 줘야 될듯)
    4. 2개 중 1개를 선택 시 그 영화를 worldcup32 리스트에 넣어주고 3번의 영화 2개를 받아오는 함수를 실행해서 보여줌
    5. 64개 영화의 리스트가 비어있을 경우 32강을 하는데 여기서 어떻게 할까
      - 1. 32강 페이지로 간다
      - 2. 그 때 worldcup32리스트가 채워져 있으면 그 중 2개를 뽑아오는 함수 실행
      - 고민? 의문점? 32강을 선택해서 들어오는 경우는? 64강에서부터 32강으로 들어올 떄는?
    
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>